<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class PermissionsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
           $permissions = [
  // المستخدمين

  'المستخدمين',
    'إنشاء مستخدمين',
    'تعديل مستخدمين',
    'حذف مستخدمين',
    'عرض المستخدمين',

    // الصلاحيات

    'الصلاحيات',
    'انشاء صلاحية ',
    'تعديل صلاحية ',
    'حذف صلاحية ',


    //   (الأصناف)

     'الأصناف ',
    'إنشاء صنف',
    'تعديل صنف',
    'حذف صنف',
    'عرض صنف',
// منتجات
    'المنتجات',
    'إنشاء منتج',
    'تعديل منتج',
    'حذف منتج',
    'عرض منتج',

    // الطاولات
    'إنشاء طاولات',
    'تعديل طاولات',
    'حذف طاولات',
    'عرض الطاولات',

    // العروض
    'إنشاء عروض',
    'تعديل عروض',
    'حذف عروض',
    'عرض العروض',

    // الحجوزات
    'إنشاء حجوزات',
    'تعديل حجوزات',
    'حذف حجوزات',
    'عرض الحجوزات',


    // الطلبات
    'الطالبات',
    'إنشاء طلبات',
    'تعديل طلبات',
    'حذف طلبات',
    'عرض الطلبات',
    'تحديث حالة الطلب',

    // المطبخ
    'عرض طلبات المطبخ',
    'تحديث حالة الطلب بالمطبخ',

    // التقارير
    'التقارير',
    'عرض التقارير',
        ];

        foreach ($permissions as $perm) {
            Permission::create(['name' => $perm]);
        }
    }
}
