<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class PermissionsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
 $permissions = [
            // المستخدمين
            'الاعدادات',
            'المستخدمين',
            'اضافة مستخدمين',
            'تعديل مستخدمين',
            'حذف مستخدمين',
            'عرض المستخدمين',




            // الصلاحيات

            'الصلاحيات',
            'اضافة صلاحية',
            'تعديل صلاحية',
            'حذف صلاحية',

            'اعدادت السيستم',

            // الأصناف
            'الاقسام',
            'اضافة صنف',
            'تعديل صنف',
            'حذف صنف',
            'عرض صنف',

            // المنتجات
            'المنتجات',
            'اضافة منتج',
            'تعديل منتج',
            'حذف منتج',
            'عرض منتج',

            // الطاولات
            'الطاولات',
            'اضافة طاولات',
            'تعديل طاولات',
            'حذف طاولات',
            'عرض الطاولات',

            // الحجوزات
            'الحجوزات',
            'اضافة حجوزات',
            'تعديل حجوزات',
            'حذف حجوزات',
            'عرض الحجوزات',

            // الطلبات
            'الطلبات',
            'اضافة طلبات',
            'تعديل طلبات',
            'حذف طلبات',
            'عرض الطلبات',
            'تحديث حالة الطلب',

            // المطبخ
            'المطبخ',
            'عرض طلبات المطبخ',
            'تحديث حالة الطلب بالمطبخ',

            // التقارير
            'التقارير',
            'عرض التقارير',

            // الكاشير
            'الكاشير',

        ];


        foreach ($permissions as $perm) {
            Permission::firstOrCreate([
                'name' => $perm,
                'guard_name' => 'web'
            ]);
        }
    }
}
