-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Feb 14, 2026 at 06:25 AM
-- Server version: 8.4.3
-- PHP Version: 8.3.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `food_system`
--

-- --------------------------------------------------------

--
-- Table structure for table `cache`
--

CREATE TABLE `cache` (
  `key` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `value` mediumtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `expiration` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `cache`
--

INSERT INTO `cache` (`key`, `value`, `expiration`) VALUES
('laravel-cache-spatie.permission.cache', 'a:3:{s:5:\"alias\";a:4:{s:1:\"a\";s:2:\"id\";s:1:\"b\";s:4:\"name\";s:1:\"c\";s:10:\"guard_name\";s:1:\"r\";s:5:\"roles\";}s:11:\"permissions\";a:46:{i:0;a:4:{s:1:\"a\";i:1;s:1:\"b\";s:18:\"الاعدادات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:1;a:4:{s:1:\"a\";i:2;s:1:\"b\";s:20:\"المستخدمين\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:2;a:4:{s:1:\"a\";i:3;s:1:\"b\";s:27:\"اضافة مستخدمين\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:3;a:4:{s:1:\"a\";i:4;s:1:\"b\";s:27:\"تعديل مستخدمين\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:4;a:4:{s:1:\"a\";i:5;s:1:\"b\";s:23:\"حذف مستخدمين\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:5;a:4:{s:1:\"a\";i:6;s:1:\"b\";s:27:\"عرض المستخدمين\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:6;a:4:{s:1:\"a\";i:7;s:1:\"b\";s:18:\"الصلاحيات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:7;a:4:{s:1:\"a\";i:8;s:1:\"b\";s:23:\"اضافة صلاحية\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:8;a:4:{s:1:\"a\";i:9;s:1:\"b\";s:23:\"تعديل صلاحية\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:9;a:4:{s:1:\"a\";i:10;s:1:\"b\";s:19:\"حذف صلاحية\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:10;a:4:{s:1:\"a\";i:11;s:1:\"b\";s:27:\"اعدادت السيستم\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:11;a:4:{s:1:\"a\";i:12;s:1:\"b\";s:14:\"الاقسام\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:12;a:4:{s:1:\"a\";i:13;s:1:\"b\";s:17:\"اضافة صنف\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:13;a:4:{s:1:\"a\";i:14;s:1:\"b\";s:17:\"تعديل صنف\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:14;a:4:{s:1:\"a\";i:15;s:1:\"b\";s:13:\"حذف صنف\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:15;a:4:{s:1:\"a\";i:16;s:1:\"b\";s:13:\"عرض صنف\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:16;a:4:{s:1:\"a\";i:17;s:1:\"b\";s:16:\"المنتجات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:17;a:4:{s:1:\"a\";i:18;s:1:\"b\";s:19:\"اضافة منتج\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:18;a:4:{s:1:\"a\";i:19;s:1:\"b\";s:19:\"تعديل منتج\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:19;a:4:{s:1:\"a\";i:20;s:1:\"b\";s:15:\"حذف منتج\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:20;a:4:{s:1:\"a\";i:21;s:1:\"b\";s:15:\"عرض منتج\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:21;a:4:{s:1:\"a\";i:22;s:1:\"b\";s:16:\"الطاولات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:5;}}i:22;a:4:{s:1:\"a\";i:23;s:1:\"b\";s:23:\"اضافة طاولات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:23;a:4:{s:1:\"a\";i:24;s:1:\"b\";s:23:\"تعديل طاولات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:5;}}i:24;a:4:{s:1:\"a\";i:25;s:1:\"b\";s:19:\"حذف طاولات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:25;a:4:{s:1:\"a\";i:26;s:1:\"b\";s:23:\"عرض الطاولات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:5;}}i:26;a:4:{s:1:\"a\";i:27;s:1:\"b\";s:16:\"الحجوزات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:5;}}i:27;a:4:{s:1:\"a\";i:28;s:1:\"b\";s:23:\"اضافة حجوزات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:5;}}i:28;a:4:{s:1:\"a\";i:29;s:1:\"b\";s:23:\"تعديل حجوزات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:5;}}i:29;a:4:{s:1:\"a\";i:30;s:1:\"b\";s:19:\"حذف حجوزات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:30;a:4:{s:1:\"a\";i:31;s:1:\"b\";s:23:\"عرض الحجوزات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:5;}}i:31;a:4:{s:1:\"a\";i:32;s:1:\"b\";s:14:\"الطلبات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:8;}}i:32;a:4:{s:1:\"a\";i:33;s:1:\"b\";s:21:\"اضافة طلبات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:33;a:4:{s:1:\"a\";i:34;s:1:\"b\";s:21:\"تعديل طلبات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:34;a:4:{s:1:\"a\";i:35;s:1:\"b\";s:17:\"حذف طلبات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:35;a:4:{s:1:\"a\";i:36;s:1:\"b\";s:21:\"عرض الطلبات\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:8;}}i:36;a:4:{s:1:\"a\";i:37;s:1:\"b\";s:30:\"تحديث حالة الطلب\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:37;a:4:{s:1:\"a\";i:38;s:1:\"b\";s:12:\"المطبخ\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:9;}}i:38;a:4:{s:1:\"a\";i:39;s:1:\"b\";s:30:\"عرض طلبات المطبخ\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:9;}}i:39;a:4:{s:1:\"a\";i:40;s:1:\"b\";s:45:\"تحديث حالة الطلب بالمطبخ\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:9;}}i:40;a:4:{s:1:\"a\";i:41;s:1:\"b\";s:16:\"التقارير\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:41;a:4:{s:1:\"a\";i:42;s:1:\"b\";s:23:\"عرض التقارير\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:42;a:4:{s:1:\"a\";i:43;s:1:\"b\";s:14:\"الكاشير\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:2:{i:0;i:1;i:1;i:8;}}i:43;a:4:{s:1:\"a\";i:44;s:1:\"b\";s:23:\"لوحة المسوول\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:44;a:4:{s:1:\"a\";i:45;s:1:\"b\";s:26:\"اسليدر الموقع \";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}i:45;a:4:{s:1:\"a\";i:46;s:1:\"b\";s:25:\"الموقع للمطعم\";s:1:\"c\";s:3:\"web\";s:1:\"r\";a:1:{i:0;i:1;}}}s:5:\"roles\";a:4:{i:0;a:3:{s:1:\"a\";i:1;s:1:\"b\";s:5:\"admin\";s:1:\"c\";s:3:\"web\";}i:1;a:3:{s:1:\"a\";i:5;s:1:\"b\";s:6:\"waiter\";s:1:\"c\";s:3:\"web\";}i:2;a:3:{s:1:\"a\";i:8;s:1:\"b\";s:7:\"Cashier\";s:1:\"c\";s:3:\"web\";}i:3;a:3:{s:1:\"a\";i:9;s:1:\"b\";s:13:\"Kitchen Staff\";s:1:\"c\";s:3:\"web\";}}}', 1771108942);

-- --------------------------------------------------------

--
-- Table structure for table `cache_locks`
--

CREATE TABLE `cache_locks` (
  `key` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `owner` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `expiration` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` bigint UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`, `created_at`, `updated_at`) VALUES
(10, 'السندوتشات', '2026-02-09 21:16:44', '2026-02-09 21:16:44'),
(12, 'الوجبات', '2026-02-09 21:19:40', '2026-02-09 21:19:40'),
(13, 'الاطباق', '2026-02-09 21:21:11', '2026-02-09 23:38:55'),
(14, 'سلطات', '2026-02-09 21:21:34', '2026-02-09 21:21:34'),
(15, 'مشروبات', '2026-02-09 21:21:53', '2026-02-09 21:21:53'),
(16, 'الحلو', '2026-02-09 21:22:07', '2026-02-09 21:22:07');

-- --------------------------------------------------------

--
-- Table structure for table `customer_carts`
--

CREATE TABLE `customer_carts` (
  `id` bigint UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `address` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `total` decimal(10,2) NOT NULL DEFAULT '0.00',
  `status` enum('pending','completed') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'pending',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `customer_carts`
--

INSERT INTO `customer_carts` (`id`, `name`, `phone`, `email`, `address`, `total`, `status`, `created_at`, `updated_at`) VALUES
(1, 'Tyrone Mann', '01225399159', 'bygyvypic@mailinator.com', 'Blanditiis tempor ul', 85.00, 'pending', '2026-02-14 05:29:36', '2026-02-14 05:29:36');

-- --------------------------------------------------------

--
-- Table structure for table `customer_cart_ors`
--

CREATE TABLE `customer_cart_ors` (
  `id` bigint UNSIGNED NOT NULL,
  `product_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `quantity` int NOT NULL DEFAULT '1',
  `price` decimal(10,2) NOT NULL,
  `total` decimal(10,2) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `customer_cart_ors`
--

INSERT INTO `customer_cart_ors` (`id`, `product_name`, `quantity`, `price`, `total`, `created_at`, `updated_at`) VALUES
(1, 'ساندوتش كفتة مشوية', 1, 20.00, 20.00, '2026-02-14 05:29:36', '2026-02-14 05:29:36'),
(2, 'ساندوتش دجاج بانيه', 1, 30.00, 30.00, '2026-02-14 05:29:36', '2026-02-14 05:29:36'),
(3, 'ساندوتش دجاج بانيه مع جبنة موتزاريلا', 1, 35.00, 35.00, '2026-02-14 05:29:36', '2026-02-14 05:29:36');

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `jobs`
--

CREATE TABLE `jobs` (
  `id` bigint UNSIGNED NOT NULL,
  `queue` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `attempts` tinyint UNSIGNED NOT NULL,
  `reserved_at` int UNSIGNED DEFAULT NULL,
  `available_at` int UNSIGNED NOT NULL,
  `created_at` int UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `job_batches`
--

CREATE TABLE `job_batches` (
  `id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `total_jobs` int NOT NULL,
  `pending_jobs` int NOT NULL,
  `failed_jobs` int NOT NULL,
  `failed_job_ids` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `options` mediumtext COLLATE utf8mb4_unicode_ci,
  `cancelled_at` int DEFAULT NULL,
  `created_at` int NOT NULL,
  `finished_at` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '0001_01_01_000000_create_users_table', 1),
(2, '0001_01_01_000001_create_cache_table', 1),
(3, '0001_01_01_000002_create_jobs_table', 1),
(4, '2026_01_21_031309_create_permission_tables', 1),
(5, '2026_01_22_200628_create_categories_table', 1),
(6, '2026_01_23_004145_create_products_table', 1),
(7, '2026_01_23_230825_create_tables_table', 1),
(8, '2026_01_23_232009_create_reservations_table', 1),
(9, '2026_01_30_020802_create_orders_table', 1),
(12, '2026_02_09_211833_create_sliders_table', 2),
(18, '2026_01_30_195405_create_order_items_table', 3),
(19, '2026_02_14_071736_create_customer_carts_table', 3),
(20, '2026_02_14_071746_create_customer_cart_ors_table', 3);

-- --------------------------------------------------------

--
-- Table structure for table `model_has_permissions`
--

CREATE TABLE `model_has_permissions` (
  `permission_id` bigint UNSIGNED NOT NULL,
  `model_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model_id` bigint UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `model_has_roles`
--

CREATE TABLE `model_has_roles` (
  `role_id` bigint UNSIGNED NOT NULL,
  `model_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model_id` bigint UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `model_has_roles`
--

INSERT INTO `model_has_roles` (`role_id`, `model_type`, `model_id`) VALUES
(1, 'App\\Models\\User', 1),
(5, 'App\\Models\\User', 3),
(8, 'App\\Models\\User', 4),
(9, 'App\\Models\\User', 5);

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `id` bigint UNSIGNED NOT NULL,
  `table_id` bigint UNSIGNED DEFAULT NULL,
  `user_id` bigint UNSIGNED NOT NULL,
  `status` enum('pending','preparing','ready','completed') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'pending',
  `total` decimal(8,2) NOT NULL DEFAULT '0.00',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`id`, `table_id`, `user_id`, `status`, `total`, `created_at`, `updated_at`) VALUES
(73, NULL, 1, 'completed', 152.00, '2026-02-09 21:55:15', '2026-02-09 21:55:27'),
(74, NULL, 1, 'completed', 200.00, '2026-02-09 21:56:59', '2026-02-09 21:57:08'),
(75, NULL, 1, 'completed', 47.00, '2026-02-09 22:19:57', '2026-02-09 22:20:19'),
(76, NULL, 1, 'completed', 47.00, '2026-02-09 22:21:13', '2026-02-09 22:21:21'),
(78, NULL, 1, 'completed', 117.00, '2026-02-09 22:32:55', '2026-02-09 22:33:02'),
(79, NULL, 4, 'completed', 210.00, '2026-02-10 00:02:29', '2026-02-10 01:54:30'),
(84, 4, 1, 'completed', 40.00, '2026-02-10 02:09:10', '2026-02-10 16:09:13'),
(85, NULL, 1, 'completed', 70.00, '2026-02-10 15:59:16', '2026-02-10 16:09:11'),
(86, 6, 1, 'completed', 70.00, '2026-02-10 17:18:38', '2026-02-10 17:19:04'),
(87, NULL, 1, 'completed', 70.00, '2026-02-10 17:20:01', '2026-02-11 21:03:44'),
(88, NULL, 1, 'completed', 257.00, '2026-02-10 17:25:01', '2026-02-11 21:03:40'),
(89, NULL, 1, 'completed', 385.00, '2026-02-11 21:04:08', '2026-02-11 21:04:40'),
(90, NULL, 1, 'completed', 57.00, '2026-02-11 21:09:25', '2026-02-11 21:17:16'),
(91, NULL, 1, 'completed', 157.00, '2026-02-11 21:11:51', '2026-02-11 21:17:20'),
(92, NULL, 1, 'completed', 232.00, '2026-02-11 21:18:18', '2026-02-12 00:36:05'),
(93, NULL, 1, 'completed', 152.00, '2026-02-11 21:18:32', '2026-02-12 00:36:04'),
(94, NULL, 1, 'completed', 235.00, '2026-02-12 00:35:38', '2026-02-12 00:36:02'),
(95, NULL, 1, 'completed', 50.00, '2026-02-12 14:37:10', '2026-02-12 14:37:44'),
(96, NULL, 1, 'completed', 20.00, '2026-02-12 14:39:34', '2026-02-12 17:58:55'),
(97, 3, 1, 'completed', 70.00, '2026-02-12 17:59:07', '2026-02-12 17:59:15'),
(98, 7, 1, 'completed', 77.00, '2026-02-12 18:42:12', '2026-02-12 18:42:54'),
(99, 7, 1, 'completed', 162.00, '2026-02-12 22:09:11', '2026-02-12 22:09:38'),
(100, 7, 1, 'completed', 92.00, '2026-02-12 22:10:02', '2026-02-12 22:10:19'),
(101, 7, 1, 'completed', 50.00, '2026-02-12 23:34:06', '2026-02-12 23:34:22'),
(102, 7, 1, 'completed', 20.00, '2026-02-13 02:48:43', '2026-02-13 02:49:10'),
(103, 9, 1, 'completed', 152.00, '2026-02-13 02:50:29', '2026-02-13 02:50:41'),
(104, 7, 1, 'completed', 27.00, '2026-02-13 02:52:11', '2026-02-13 02:52:21'),
(105, NULL, 1, 'completed', 118.00, '2026-02-13 16:20:13', '2026-02-13 18:50:38'),
(106, NULL, 1, 'completed', 60.00, '2026-02-13 18:50:21', '2026-02-13 18:50:35');

-- --------------------------------------------------------

--
-- Table structure for table `order_items`
--

CREATE TABLE `order_items` (
  `id` bigint UNSIGNED NOT NULL,
  `order_id` bigint UNSIGNED NOT NULL,
  `product_id` bigint UNSIGNED NOT NULL,
  `quantity` int NOT NULL DEFAULT '1',
  `price` decimal(8,2) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `order_items`
--

INSERT INTO `order_items` (`id`, `order_id`, `product_id`, `quantity`, `price`, `created_at`, `updated_at`) VALUES
(202, 73, 24, 1, 25.00, '2026-02-09 21:55:15', '2026-02-09 21:55:15'),
(203, 73, 21, 1, 20.00, '2026-02-09 21:55:15', '2026-02-09 21:55:15'),
(204, 73, 25, 1, 40.00, '2026-02-09 21:55:15', '2026-02-09 21:55:15'),
(205, 73, 26, 1, 27.00, '2026-02-09 21:55:15', '2026-02-09 21:55:15'),
(206, 73, 45, 1, 20.00, '2026-02-09 21:55:15', '2026-02-09 21:55:15'),
(207, 73, 46, 1, 20.00, '2026-02-09 21:55:15', '2026-02-09 21:55:15'),
(208, 74, 29, 1, 100.00, '2026-02-09 21:56:59', '2026-02-09 21:56:59'),
(209, 74, 34, 1, 10.00, '2026-02-09 21:56:59', '2026-02-09 21:56:59'),
(210, 74, 33, 1, 10.00, '2026-02-09 21:56:59', '2026-02-09 21:56:59'),
(211, 74, 37, 1, 20.00, '2026-02-09 21:56:59', '2026-02-09 21:56:59'),
(212, 74, 46, 3, 20.00, '2026-02-09 21:56:59', '2026-02-09 21:56:59'),
(213, 75, 22, 1, 20.00, '2026-02-09 22:19:57', '2026-02-09 22:19:57'),
(214, 75, 26, 1, 27.00, '2026-02-09 22:19:57', '2026-02-09 22:19:57'),
(215, 76, 22, 1, 20.00, '2026-02-09 22:21:13', '2026-02-09 22:21:13'),
(216, 76, 26, 1, 27.00, '2026-02-09 22:21:13', '2026-02-09 22:21:13'),
(221, 78, 28, 1, 35.00, '2026-02-09 22:32:55', '2026-02-09 22:32:55'),
(222, 78, 27, 1, 30.00, '2026-02-09 22:32:55', '2026-02-09 22:32:55'),
(223, 78, 24, 1, 25.00, '2026-02-09 22:32:55', '2026-02-09 22:32:55'),
(224, 78, 26, 1, 27.00, '2026-02-09 22:32:55', '2026-02-09 22:32:55'),
(225, 79, 29, 1, 100.00, '2026-02-10 00:02:29', '2026-02-10 00:02:29'),
(226, 79, 35, 1, 15.00, '2026-02-10 00:02:29', '2026-02-10 00:02:29'),
(227, 79, 36, 1, 5.00, '2026-02-10 00:02:29', '2026-02-10 00:02:29'),
(228, 79, 40, 1, 40.00, '2026-02-10 00:02:29', '2026-02-10 00:02:29'),
(229, 79, 44, 1, 30.00, '2026-02-10 00:02:29', '2026-02-10 00:02:29'),
(230, 79, 45, 1, 20.00, '2026-02-10 00:02:29', '2026-02-10 00:02:29'),
(249, 84, 21, 1, 20.00, '2026-02-10 02:09:10', '2026-02-10 02:09:10'),
(250, 84, 22, 1, 20.00, '2026-02-10 02:09:10', '2026-02-10 02:09:10'),
(251, 85, 25, 1, 40.00, '2026-02-10 15:59:16', '2026-02-10 15:59:16'),
(252, 85, 23, 1, 30.00, '2026-02-10 15:59:16', '2026-02-10 15:59:16'),
(253, 86, 21, 1, 20.00, '2026-02-10 17:18:38', '2026-02-10 17:18:38'),
(254, 86, 22, 1, 20.00, '2026-02-10 17:18:38', '2026-02-10 17:18:38'),
(255, 86, 23, 1, 30.00, '2026-02-10 17:18:38', '2026-02-10 17:18:38'),
(256, 87, 21, 1, 20.00, '2026-02-10 17:20:01', '2026-02-10 17:20:01'),
(257, 87, 22, 1, 20.00, '2026-02-10 17:20:01', '2026-02-10 17:20:01'),
(258, 87, 23, 1, 30.00, '2026-02-10 17:20:01', '2026-02-10 17:20:01'),
(259, 88, 26, 1, 27.00, '2026-02-10 17:25:01', '2026-02-10 17:25:01'),
(260, 88, 28, 1, 35.00, '2026-02-10 17:25:01', '2026-02-10 17:25:01'),
(261, 88, 25, 1, 40.00, '2026-02-10 17:25:01', '2026-02-10 17:25:01'),
(262, 88, 24, 1, 25.00, '2026-02-10 17:25:01', '2026-02-10 17:25:01'),
(263, 88, 27, 1, 30.00, '2026-02-10 17:25:01', '2026-02-10 17:25:01'),
(264, 88, 29, 1, 100.00, '2026-02-10 17:25:01', '2026-02-10 17:25:01'),
(265, 89, 29, 1, 100.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(266, 89, 28, 1, 35.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(267, 89, 27, 1, 30.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(268, 89, 24, 1, 25.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(269, 89, 25, 1, 40.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(270, 89, 26, 1, 27.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(271, 89, 23, 1, 30.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(272, 89, 22, 1, 20.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(273, 89, 21, 1, 20.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(274, 89, 45, 1, 20.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(275, 89, 46, 1, 20.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(276, 89, 48, 1, 8.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(277, 89, 51, 1, 10.00, '2026-02-11 21:04:08', '2026-02-11 21:04:08'),
(278, 90, 26, 1, 27.00, '2026-02-11 21:09:25', '2026-02-11 21:09:25'),
(279, 90, 23, 1, 30.00, '2026-02-11 21:09:25', '2026-02-11 21:09:25'),
(280, 91, 26, 1, 27.00, '2026-02-11 21:11:51', '2026-02-11 21:11:51'),
(281, 91, 23, 1, 30.00, '2026-02-11 21:11:51', '2026-02-11 21:11:51'),
(282, 91, 29, 1, 100.00, '2026-02-11 21:11:51', '2026-02-11 21:11:51'),
(283, 92, 26, 1, 27.00, '2026-02-11 21:18:18', '2026-02-11 21:18:18'),
(284, 92, 23, 1, 30.00, '2026-02-11 21:18:18', '2026-02-11 21:18:18'),
(285, 92, 25, 1, 40.00, '2026-02-11 21:18:18', '2026-02-11 21:18:18'),
(286, 92, 28, 1, 35.00, '2026-02-11 21:18:18', '2026-02-11 21:18:18'),
(287, 92, 29, 1, 100.00, '2026-02-11 21:18:18', '2026-02-11 21:18:18'),
(288, 93, 29, 1, 100.00, '2026-02-11 21:18:32', '2026-02-11 21:18:32'),
(289, 93, 26, 1, 27.00, '2026-02-11 21:18:32', '2026-02-11 21:18:32'),
(290, 93, 24, 1, 25.00, '2026-02-11 21:18:32', '2026-02-11 21:18:32'),
(291, 94, 29, 1, 100.00, '2026-02-12 00:35:38', '2026-02-12 00:35:38'),
(292, 94, 34, 1, 10.00, '2026-02-12 00:35:38', '2026-02-12 00:35:38'),
(293, 94, 33, 1, 10.00, '2026-02-12 00:35:38', '2026-02-12 00:35:38'),
(294, 94, 36, 1, 5.00, '2026-02-12 00:35:38', '2026-02-12 00:35:38'),
(295, 94, 37, 1, 20.00, '2026-02-12 00:35:38', '2026-02-12 00:35:38'),
(296, 94, 40, 1, 40.00, '2026-02-12 00:35:38', '2026-02-12 00:35:38'),
(297, 94, 44, 1, 30.00, '2026-02-12 00:35:38', '2026-02-12 00:35:38'),
(298, 94, 53, 1, 20.00, '2026-02-12 00:35:38', '2026-02-12 00:35:38'),
(299, 95, 22, 1, 20.00, '2026-02-12 14:37:10', '2026-02-12 14:37:10'),
(300, 95, 23, 1, 30.00, '2026-02-12 14:37:10', '2026-02-12 14:37:10'),
(301, 96, 53, 1, 20.00, '2026-02-12 14:39:34', '2026-02-12 14:39:34'),
(302, 97, 21, 1, 20.00, '2026-02-12 17:59:07', '2026-02-12 17:59:07'),
(303, 97, 22, 1, 20.00, '2026-02-12 17:59:07', '2026-02-12 17:59:07'),
(304, 97, 23, 1, 30.00, '2026-02-12 17:59:07', '2026-02-12 17:59:07'),
(305, 98, 23, 1, 30.00, '2026-02-12 18:42:12', '2026-02-12 18:42:12'),
(306, 98, 26, 1, 27.00, '2026-02-12 18:42:12', '2026-02-12 18:42:12'),
(307, 98, 45, 1, 20.00, '2026-02-12 18:42:12', '2026-02-12 18:42:12'),
(308, 99, 21, 1, 20.00, '2026-02-12 22:09:11', '2026-02-12 22:09:11'),
(309, 99, 22, 1, 20.00, '2026-02-12 22:09:11', '2026-02-12 22:09:11'),
(310, 99, 23, 1, 30.00, '2026-02-12 22:09:11', '2026-02-12 22:09:11'),
(311, 99, 26, 1, 27.00, '2026-02-12 22:09:11', '2026-02-12 22:09:11'),
(312, 99, 25, 1, 40.00, '2026-02-12 22:09:11', '2026-02-12 22:09:11'),
(313, 99, 24, 1, 25.00, '2026-02-12 22:09:11', '2026-02-12 22:09:11'),
(314, 100, 26, 1, 27.00, '2026-02-12 22:10:02', '2026-02-12 22:10:02'),
(315, 100, 25, 1, 40.00, '2026-02-12 22:10:02', '2026-02-12 22:10:02'),
(316, 100, 24, 1, 25.00, '2026-02-12 22:10:02', '2026-02-12 22:10:02'),
(317, 101, 23, 1, 30.00, '2026-02-12 23:34:06', '2026-02-12 23:34:06'),
(318, 101, 22, 1, 20.00, '2026-02-12 23:34:06', '2026-02-12 23:34:06'),
(319, 102, 22, 1, 20.00, '2026-02-13 02:48:43', '2026-02-13 02:48:43'),
(320, 103, 23, 1, 30.00, '2026-02-13 02:50:29', '2026-02-13 02:50:29'),
(321, 103, 26, 1, 27.00, '2026-02-13 02:50:29', '2026-02-13 02:50:29'),
(322, 103, 25, 1, 40.00, '2026-02-13 02:50:29', '2026-02-13 02:50:29'),
(323, 103, 22, 1, 20.00, '2026-02-13 02:50:29', '2026-02-13 02:50:29'),
(324, 103, 28, 1, 35.00, '2026-02-13 02:50:29', '2026-02-13 02:50:29'),
(325, 104, 26, 1, 27.00, '2026-02-13 02:52:11', '2026-02-13 02:52:11'),
(326, 105, 29, 1, 100.00, '2026-02-13 16:20:13', '2026-02-13 16:20:13'),
(327, 105, 51, 1, 10.00, '2026-02-13 16:20:13', '2026-02-13 16:20:13'),
(328, 105, 48, 1, 8.00, '2026-02-13 16:20:13', '2026-02-13 16:20:13'),
(329, 106, 21, 1, 20.00, '2026-02-13 18:50:21', '2026-02-13 18:50:21'),
(330, 106, 22, 1, 20.00, '2026-02-13 18:50:21', '2026-02-13 18:50:21'),
(331, 106, 46, 1, 20.00, '2026-02-13 18:50:21', '2026-02-13 18:50:21');

-- --------------------------------------------------------

--
-- Table structure for table `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `permissions`
--

CREATE TABLE `permissions` (
  `id` bigint UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `guard_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `permissions`
--

INSERT INTO `permissions` (`id`, `name`, `guard_name`, `created_at`, `updated_at`) VALUES
(1, 'الاعدادات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(2, 'المستخدمين', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(3, 'اضافة مستخدمين', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(4, 'تعديل مستخدمين', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(5, 'حذف مستخدمين', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(6, 'عرض المستخدمين', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(7, 'الصلاحيات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(8, 'اضافة صلاحية', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(9, 'تعديل صلاحية', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(10, 'حذف صلاحية', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(11, 'اعدادت السيستم', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(12, 'الاقسام', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(13, 'اضافة صنف', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(14, 'تعديل صنف', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(15, 'حذف صنف', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(16, 'عرض صنف', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(17, 'المنتجات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(18, 'اضافة منتج', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(19, 'تعديل منتج', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(20, 'حذف منتج', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(21, 'عرض منتج', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(22, 'الطاولات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(23, 'اضافة طاولات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(24, 'تعديل طاولات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(25, 'حذف طاولات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(26, 'عرض الطاولات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(27, 'الحجوزات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(28, 'اضافة حجوزات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(29, 'تعديل حجوزات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(30, 'حذف حجوزات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(31, 'عرض الحجوزات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(32, 'الطلبات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(33, 'اضافة طلبات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(34, 'تعديل طلبات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(35, 'حذف طلبات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(36, 'عرض الطلبات', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(37, 'تحديث حالة الطلب', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(38, 'المطبخ', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(39, 'عرض طلبات المطبخ', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(40, 'تحديث حالة الطلب بالمطبخ', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(41, 'التقارير', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(42, 'عرض التقارير', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(43, 'الكاشير', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(44, 'لوحة المسوول', 'web', '2026-02-08 03:52:44', '2026-02-08 03:52:44'),
(45, 'اسليدر الموقع ', 'web', '2026-02-09 23:45:39', '2026-02-09 23:45:39'),
(46, 'الموقع للمطعم', 'web', '2026-02-09 23:49:31', '2026-02-09 23:49:31');

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` bigint UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category_id` bigint UNSIGNED NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `price` double NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `name`, `category_id`, `image`, `price`, `created_at`, `updated_at`) VALUES
(21, 'ساندوتش كفتة مشوية', 10, '1770672225_كفتة_مشوية.jpg', 20, '2026-02-09 21:23:45', '2026-02-09 21:23:45'),
(22, 'ساندوتش كبدة إسكندراني', 10, '1770672274_كبده_اسكندرانى.jpg', 20, '2026-02-09 21:24:34', '2026-02-09 21:24:34'),
(23, 'ساندوتش دجاج بانيه', 10, '1770672311_فراخ_بانيه.jpg', 30, '2026-02-09 21:25:11', '2026-02-09 21:25:11'),
(24, 'ساندوتش حواوشى', 10, '1770672376_حواوشى_سبايسي.jpg', 25, '2026-02-09 21:26:16', '2026-02-09 21:26:16'),
(25, 'ساندوتش شيش طاووق', 10, '1770672427_ساندوتش_شيش_طاووق.jpg', 40, '2026-02-09 21:27:07', '2026-02-09 21:27:07'),
(26, 'ساندوتش سجق بلدي', 10, '1770672467_سجق.jpg', 27, '2026-02-09 21:27:47', '2026-02-09 21:27:47'),
(27, 'ساندوتش كفتة فراخ', 10, '1770672532_ساندوتش_كفتة_فراخ.jpg', 30, '2026-02-09 21:28:52', '2026-02-09 21:28:52'),
(28, 'ساندوتش دجاج بانيه مع جبنة موتزاريلا', 10, '1770672584_فراخ_بانيه_بالموزاريلا.jpg', 35, '2026-02-09 21:29:44', '2026-02-09 21:29:44'),
(29, 'نص فرخه مشويه', 12, '1770672665_نص_فرخه_مشويه.jpg', 100, '2026-02-09 21:31:05', '2026-02-09 21:31:05'),
(30, 'سجق فراخ مشوى', 12, '1770672727_سجق_فراخ_مشوى.jpg', 150, '2026-02-09 21:32:07', '2026-02-09 21:32:07'),
(31, 'حمام مشوي', 12, '1770672768_حمام_مشوي.jpg', 200, '2026-02-09 21:32:48', '2026-02-09 21:32:48'),
(32, 'ربع ورك فرخه مشويه', 12, '1770672837_نص_فرخه_مشويه.jpg', 60, '2026-02-09 21:33:57', '2026-02-09 21:33:57'),
(33, 'طحينة', 14, '1770672959_طحينة.jpg', 10, '2026-02-09 21:35:59', '2026-02-09 21:35:59'),
(34, 'سلطة بلدى', 14, '1770672991_سلطة_بلدى.jpg', 10, '2026-02-09 21:36:31', '2026-02-09 21:36:31'),
(35, 'بابا غنوج', 14, '1770673019_بابا_غنوج.jpg', 15, '2026-02-09 21:36:59', '2026-02-09 21:36:59'),
(36, 'طرشى بلدى', 14, '1770673142_طرشى_بلدى.jpg', 5, '2026-02-09 21:38:27', '2026-02-09 21:39:02'),
(37, 'باذنجان مخلل', 14, '1770673171_باذنجان_مخلل.jpg', 20, '2026-02-09 21:39:31', '2026-02-09 21:39:31'),
(38, 'كفتة مشوية و طرب', 12, '1770673285_كفتة_مشوية_و_طرب.jpg', 200, '2026-02-09 21:41:25', '2026-02-09 21:41:25'),
(39, 'أرز مسلوق', 13, '1770673333_أرز_مسلوق.jpg', 40, '2026-02-09 21:42:13', '2026-02-09 21:42:13'),
(40, 'أرز بالخلطه', 13, '1770673362_أرز_بالخلطه.jpg', 40, '2026-02-09 21:42:42', '2026-02-09 21:42:42'),
(41, 'مكرونه اسباجتي باللحمه المفرومه', 13, '1770673400_مكرونه_سباغتي_باللحمه_المفرومه.jpg', 60, '2026-02-09 21:43:20', '2026-02-09 21:43:20'),
(42, 'مكرونه بالبشاميل واللحمه المفرومه بالفرن', 13, '1770673428_مكرونه_بالباشمل_اللحمه_المفرومه_بالفرن.jpg', 50, '2026-02-09 21:43:48', '2026-02-09 21:43:48'),
(43, 'طبق ممبار', 13, '1770673452_طبق_ممبار.jpg', 70, '2026-02-09 21:44:12', '2026-02-09 21:44:12'),
(44, 'شوربة لسان عصفور', 13, '1770673497_شوربة_لسان_عصفور.jpg', 30, '2026-02-09 21:44:57', '2026-02-09 21:44:57'),
(45, 'كوكاكولا علب', 15, '1770673556_كوكاكولا_علب.png', 20, '2026-02-09 21:45:56', '2026-02-09 21:46:25'),
(46, 'سبرايت علب', 15, '1770673607_سبرايت_علب.png', 20, '2026-02-09 21:46:47', '2026-02-09 21:46:47'),
(47, 'عصير جوافة', 15, '1770673630_عصير_جوافة.jpg', 25, '2026-02-09 21:47:10', '2026-02-09 21:47:10'),
(48, 'مياه معدنية', 15, '1770673656_مياه_معدنية.jpg', 8, '2026-02-09 21:47:36', '2026-02-09 21:47:36'),
(49, 'عصير ليمون', 15, '1770673682_عصير_ليمون.jpg', 20, '2026-02-09 21:48:02', '2026-02-09 21:48:02'),
(50, 'عصير مانجو', 15, '1770673710_عصير_مانجو.jpg', 25, '2026-02-09 21:48:30', '2026-02-09 21:48:30'),
(51, 'شاى', 15, '1770673775_شاى.jpg', 10, '2026-02-09 21:49:35', '2026-02-09 21:49:35'),
(52, 'قهوة', 15, '1770673821_قهوة.jpg', 20, '2026-02-09 21:50:21', '2026-02-09 21:50:21'),
(53, 'ارز باللبن', 16, '1770673892_ارز_باللبن.jpg', 20, '2026-02-09 21:51:32', '2026-02-09 21:51:32'),
(54, 'اوريو كيك', 16, '1770673935_اوريو_كيك.jpg', 25, '2026-02-09 21:52:15', '2026-02-09 21:52:15'),
(55, 'ام على بالمكسرات', 16, '1770673977_ام_على_بالمكسرات.jpg', 20, '2026-02-09 21:52:57', '2026-02-09 21:52:57');

-- --------------------------------------------------------

--
-- Table structure for table `reservations`
--

CREATE TABLE `reservations` (
  `id` bigint UNSIGNED NOT NULL,
  `customer_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `guest_count` int NOT NULL,
  `table_id` bigint UNSIGNED NOT NULL,
  `status` enum('في الانتظار','تم الحجز','اكتمل الطلب','ملغي') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'في الانتظار',
  `datetime` datetime NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `reservations`
--

INSERT INTO `reservations` (`id`, `customer_name`, `phone`, `guest_count`, `table_id`, `status`, `datetime`, `created_at`, `updated_at`) VALUES
(13, 'باشمهندس اسلام', '01225399159', 1, 5, 'تم الحجز', '2026-02-10 04:06:00', '2026-02-10 02:06:57', '2026-02-10 16:23:43'),
(15, 'باشمهندس مصطفى محفوظ', '٠١٢٢٥٣٩٩١٥٩', 1, 3, 'تم الحجز', '2026-02-10 05:34:00', '2026-02-10 03:35:10', '2026-02-10 16:23:18'),
(16, 'باشمهندس عبد الله', '01225399159', 1, 10, 'تم الحجز', '2026-02-10 18:24:00', '2026-02-10 16:24:12', '2026-02-13 02:49:57'),
(17, 'باشمهندس زياد', '01225399159', 1, 3, 'تم الحجز', '2026-02-10 19:14:00', '2026-02-10 17:14:35', '2026-02-12 23:18:02');

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` bigint UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `guard_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `name`, `guard_name`, `created_at`, `updated_at`) VALUES
(1, 'admin', 'web', '2026-02-03 21:57:17', '2026-02-03 21:57:17'),
(5, 'waiter', 'web', '2026-02-03 23:16:23', '2026-02-03 23:16:23'),
(8, 'Cashier', 'web', '2026-02-03 23:46:16', '2026-02-03 23:46:16'),
(9, 'Kitchen Staff', 'web', '2026-02-03 23:48:46', '2026-02-03 23:48:46');

-- --------------------------------------------------------

--
-- Table structure for table `role_has_permissions`
--

CREATE TABLE `role_has_permissions` (
  `permission_id` bigint UNSIGNED NOT NULL,
  `role_id` bigint UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `role_has_permissions`
--

INSERT INTO `role_has_permissions` (`permission_id`, `role_id`) VALUES
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 1),
(6, 1),
(7, 1),
(8, 1),
(9, 1),
(10, 1),
(11, 1),
(12, 1),
(13, 1),
(14, 1),
(15, 1),
(16, 1),
(17, 1),
(18, 1),
(19, 1),
(20, 1),
(21, 1),
(22, 1),
(23, 1),
(24, 1),
(25, 1),
(26, 1),
(27, 1),
(28, 1),
(29, 1),
(30, 1),
(31, 1),
(32, 1),
(33, 1),
(34, 1),
(35, 1),
(36, 1),
(37, 1),
(38, 1),
(39, 1),
(40, 1),
(41, 1),
(42, 1),
(43, 1),
(44, 1),
(45, 1),
(46, 1),
(22, 5),
(24, 5),
(26, 5),
(27, 5),
(28, 5),
(29, 5),
(31, 5),
(32, 8),
(36, 8),
(43, 8),
(38, 9),
(39, 9),
(40, 9);

-- --------------------------------------------------------

--
-- Table structure for table `sessions`
--

CREATE TABLE `sessions` (
  `id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` bigint UNSIGNED DEFAULT NULL,
  `ip_address` varchar(45) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `user_agent` text COLLATE utf8mb4_unicode_ci,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_activity` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sessions`
--

INSERT INTO `sessions` (`id`, `user_id`, `ip_address`, `user_agent`, `payload`, `last_activity`) VALUES
('U69pHEaTNh9wXqjq1I3zDzkNEuRMsPuBF9yQv2lN', 1, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiNXhhdVZVRTRZczBSOHBlRTF5ZkRlUGFocWNLV2pjUldnbUJPNVB5aCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6Mzc6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMC9jdXN0b21lci1vcmRlcnMiO3M6NToicm91dGUiO3M6Mjc6ImFkbWluLmN1c3RvbWVyLW9yZGVycy5pbmRleCI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fXM6NTA6ImxvZ2luX3dlYl81OWJhMzZhZGRjMmIyZjk0MDE1ODBmMDE0YzdmNThlYTRlMzA5ODlkIjtpOjE7fQ==', 1771048295);

-- --------------------------------------------------------

--
-- Table structure for table `sliders`
--

CREATE TABLE `sliders` (
  `id` bigint UNSIGNED NOT NULL,
  `big_title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `small_title` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sliders`
--

INSERT INTO `sliders` (`id`, `big_title`, `small_title`, `image`, `created_at`, `updated_at`) VALUES
(3, 'متعة الطعم في كل وجبة', 'استمتع بأشهى المأكولات مع كل لقمة', '1770670650_bg.png', '2026-02-09 20:57:30', '2026-02-09 20:57:30'),
(4, 'إكتشف وأوردر أحلى الأكلات', NULL, '1770670792_bg2.jpg', '2026-02-09 20:59:52', '2026-02-09 20:59:52');

-- --------------------------------------------------------

--
-- Table structure for table `tables`
--

CREATE TABLE `tables` (
  `id` bigint UNSIGNED NOT NULL,
  `number` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `min_guests` int NOT NULL DEFAULT '1',
  `max_guests` int NOT NULL DEFAULT '4',
  `status` enum('متاحة','مشغولة','محجوزة') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'متاحة',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `tables`
--

INSERT INTO `tables` (`id`, `number`, `min_guests`, `max_guests`, `status`, `created_at`, `updated_at`) VALUES
(3, 'T1', 1, 4, 'محجوزة', '2026-02-10 02:03:21', '2026-02-12 23:18:02'),
(4, 'T2', 2, 4, 'محجوزة', '2026-02-10 02:03:39', '2026-02-10 02:09:10'),
(5, 'T3', 2, 5, 'محجوزة', '2026-02-10 02:04:01', '2026-02-10 16:23:43'),
(6, 'T4', 2, 3, 'محجوزة', '2026-02-10 02:04:16', '2026-02-10 17:18:38'),
(7, 'T5', 1, 2, 'محجوزة', '2026-02-10 02:04:39', '2026-02-13 02:52:11'),
(8, 'T6', 2, 4, 'متاحة', '2026-02-10 02:05:05', '2026-02-10 02:05:05'),
(9, 'T7', 1, 5, 'متاحة', '2026-02-10 02:05:29', '2026-02-13 02:50:41'),
(10, 'T8', 1, 8, 'محجوزة', '2026-02-10 02:05:48', '2026-02-13 02:49:57'),
(11, 'T9', 4, 6, 'متاحة', '2026-02-10 02:06:11', '2026-02-10 02:06:11');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'samir', 'samir@gamil.com', NULL, '$2y$12$knRXUcql1slrjGTXxQ6M4eRXhkWRhLj6gqycj4VlQnFpD5mf8tXSS', 'OsdSAv1FsnrYhUvE5kH716b2cxUtvduT7EO42m2zrfJQFhJOTKnuiyCxP09W', '2026-02-03 21:57:18', '2026-02-03 21:57:18'),
(3, 'ahmed', 'ahmed@gamil.com', NULL, '$2y$12$91meRx1FJHzoBuHZ987/EuC412YHl4QZ4TSUXQJJh5uuPLoqjcXIG', 'TPdNd3V6GVL1hXkxNOWVptnFHSafbdKyJSXWx9NtGOIwTrkNfnzpWVqjV9tf', '2026-02-03 22:42:13', '2026-02-10 17:23:06'),
(4, 'محمد', 'mohamed@gmail.com', NULL, '$2y$12$A1JYzy1yAIW5lM3IinOf2ewcIi5o9eJVQITCTszEBsMG329QVFFsi', 's8N7J6THSdGWjLdifRcpWmAXH9jbEFbh5G4Cc1atkb35oIqmOPXfc9oFiSdh', '2026-02-03 23:21:48', '2026-02-08 03:54:25'),
(5, 'على', 'ali@gamil.com', NULL, '$2y$12$zHPqdiAoEd9r8mGWgb87VecJCKsUjcSjCYwy/wk.N3L0WPkniM4Kq', NULL, '2026-02-03 23:49:10', '2026-02-10 16:20:39');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `cache`
--
ALTER TABLE `cache`
  ADD PRIMARY KEY (`key`);

--
-- Indexes for table `cache_locks`
--
ALTER TABLE `cache_locks`
  ADD PRIMARY KEY (`key`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `customer_carts`
--
ALTER TABLE `customer_carts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `customer_cart_ors`
--
ALTER TABLE `customer_cart_ors`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `jobs`
--
ALTER TABLE `jobs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `jobs_queue_index` (`queue`);

--
-- Indexes for table `job_batches`
--
ALTER TABLE `job_batches`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `model_has_permissions`
--
ALTER TABLE `model_has_permissions`
  ADD PRIMARY KEY (`permission_id`,`model_id`,`model_type`),
  ADD KEY `model_has_permissions_model_id_model_type_index` (`model_id`,`model_type`);

--
-- Indexes for table `model_has_roles`
--
ALTER TABLE `model_has_roles`
  ADD PRIMARY KEY (`role_id`,`model_id`,`model_type`),
  ADD KEY `model_has_roles_model_id_model_type_index` (`model_id`,`model_type`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `orders_table_id_foreign` (`table_id`),
  ADD KEY `orders_user_id_foreign` (`user_id`);

--
-- Indexes for table `order_items`
--
ALTER TABLE `order_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `order_items_order_id_foreign` (`order_id`),
  ADD KEY `order_items_product_id_foreign` (`product_id`);

--
-- Indexes for table `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `permissions_name_guard_name_unique` (`name`,`guard_name`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `products_category_id_foreign` (`category_id`);

--
-- Indexes for table `reservations`
--
ALTER TABLE `reservations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `reservations_table_id_foreign` (`table_id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `roles_name_guard_name_unique` (`name`,`guard_name`);

--
-- Indexes for table `role_has_permissions`
--
ALTER TABLE `role_has_permissions`
  ADD PRIMARY KEY (`permission_id`,`role_id`),
  ADD KEY `role_has_permissions_role_id_foreign` (`role_id`);

--
-- Indexes for table `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sessions_user_id_index` (`user_id`),
  ADD KEY `sessions_last_activity_index` (`last_activity`);

--
-- Indexes for table `sliders`
--
ALTER TABLE `sliders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tables`
--
ALTER TABLE `tables`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `tables_number_unique` (`number`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `customer_carts`
--
ALTER TABLE `customer_carts`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `customer_cart_ors`
--
ALTER TABLE `customer_cart_ors`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `jobs`
--
ALTER TABLE `jobs`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=107;

--
-- AUTO_INCREMENT for table `order_items`
--
ALTER TABLE `order_items`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=335;

--
-- AUTO_INCREMENT for table `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=50;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=57;

--
-- AUTO_INCREMENT for table `reservations`
--
ALTER TABLE `reservations`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `sliders`
--
ALTER TABLE `sliders`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `tables`
--
ALTER TABLE `tables`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `model_has_permissions`
--
ALTER TABLE `model_has_permissions`
  ADD CONSTRAINT `model_has_permissions_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `model_has_roles`
--
ALTER TABLE `model_has_roles`
  ADD CONSTRAINT `model_has_roles_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `orders`
--
ALTER TABLE `orders`
  ADD CONSTRAINT `orders_table_id_foreign` FOREIGN KEY (`table_id`) REFERENCES `tables` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `orders_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Constraints for table `order_items`
--
ALTER TABLE `order_items`
  ADD CONSTRAINT `order_items_order_id_foreign` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `order_items_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`);

--
-- Constraints for table `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `products_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `reservations`
--
ALTER TABLE `reservations`
  ADD CONSTRAINT `reservations_table_id_foreign` FOREIGN KEY (`table_id`) REFERENCES `tables` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `role_has_permissions`
--
ALTER TABLE `role_has_permissions`
  ADD CONSTRAINT `role_has_permissions_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `role_has_permissions_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
